In [1]:
import sqlite3 as sq3
import pandas.io.sql as pd
import pandas as pd

In [2]:
#path of database for connection
path = "classic_rock.db"

In [4]:
#making the connection with database 
con = sq3.Connection(path)

In [5]:
#conncetion object
con

In [12]:
#now we can read data by writing querey
querey = '''
SELECT* 
FROM rock_songs ;
'''

In [13]:
#run the querey ove the connection
#execution
exe = pd.read_sql(querey,con)

In [14]:
exe.head()

                     Song        Artist  Release_Year  PlayCount
0        Caught Up in You   .38 Special        1982.0         82
1         Hold On Loosely   .38 Special        1981.0         85
2  Rockin' Into the Night   .38 Special        1980.0         18
3       Art For Arts Sake          10cc        1975.0          1
4              Kryptonite  3 Doors Down        2000.0         13

In [24]:
#you can run any qurey of your choice

querey1 = '''
SELECT Artist, Release_Year, COUNT(*) AS num_songs, AVG(PlayCount) AS avg_plays  
    FROM rock_songs
    GROUP BY Artist, Release_Year
    ORDER BY num_songs desc;
'''

In [25]:
q_exe = pd.read_sql(querey1,con)

In [26]:
q_exe.head()

         Artist  Release_Year  num_songs  avg_plays
0   The Beatles        1967.0         23   6.565217
1  Led Zeppelin        1969.0         18  21.000000
2   The Beatles        1965.0         15   3.800000
3   The Beatles        1968.0         13  13.000000
4   The Beatles        1969.0         13  15.000000

In [29]:
#considering another database
path1 = 'baseball.db'

In [30]:
#making connection
con1 = sq3.Connection(path1)

In [32]:
#now writing query for the database
query_2 = '''
SELECT* 
FROM allstarfull;
'''

In [33]:
#executing the querey
exec_q = pd.read_sql(query_2,con1)

In [34]:
exec_q.head()

,index,playerID,yearID,gameNum,gameID,teamID,lgID,GP,startingPos
0,0,gomezle01,1933,0,ALS193307060,NYA,AL,1.0,1.0
1,1,ferreri01,1933,0,ALS193307060,BOS,AL,1.0,2.0
2,2,gehrilo01,1933,0,ALS193307060,NYA,AL,1.0,3.0
3,3,gehrich01,1933,0,ALS193307060,DET,AL,1.0,4.0
4,4,dykesji01,1933,0,ALS193307060,CHA,AL,1.0,5.0

In [36]:
all_tables = pd.read_sql('SELECT * FROM sqlite_master', con1)
print(all_tables)

    type                  name     tbl_name  rootpage  \
0  table           allstarfull  allstarfull         2
1  index  ix_allstarfull_index  allstarfull         3
2  table               schools      schools        26
3  index      ix_schools_index      schools        31
4  table               batting      batting        99
5  index      ix_batting_index      batting       100

                                                 sql
0  CREATE TABLE "allstarfull" (\n"index" INTEGER,...
1  CREATE INDEX "ix_allstarfull_index"ON "allstar...
2  CREATE TABLE "schools" (\n"index" INTEGER,\n  ...
3  CREATE INDEX "ix_schools_index"ON "schools" ("...
4  CREATE TABLE "batting" (\n"index" INTEGER,\n  ...
5  CREATE INDEX "ix_batting_index"ON "batting" ("...